package jc_les04.hw;

public class Task05 {

	public static void main(String[] args) {
		// Написать программу, которая выводит на экран первые четыре степени числа π.
		
		System.out.println("π^0 = " + Math.pow(Math.PI, 0)); 
        System.out.println("π^1 = " + Math.PI);
        System.out.println("π^2 = " + Math.pow(Math.PI, 2));
        System.out.println("π^3 = " + Math.pow(Math.PI, 3));

	}

}
